[Killed] ConditionalExpression
controllers/auth.js:12:9
 
     const isUsed = await User.findOne({ username });
 
-    if (isUsed) {
+    if (true) {
       return res.status(409).json({
         message: 'Даний username вже зайнятий. ',
killedBy: Full integration test: Auth → Post → Comment Register user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 409

[Killed] BlockStatement
controllers/auth.js:12:17
 
     const isUsed = await User.findOne({ username });
 
-    if (isUsed) {
-      return res.status(409).json({
-        message: 'Даний username вже зайнятий. ',
-      });
-    }
+    if (isUsed) {}
 
     const salt = bcrypt.genSaltSync(10);
killedBy: Auth controller register: повертає помилку, якщо username вже зайнятий
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 200

Number of calls: 1

[Killed] ObjectLiteral
controllers/auth.js:13:35
     const isUsed = await User.findOne({ username });
 
     if (isUsed) {
-      return res.status(409).json({
-        message: 'Даний username вже зайнятий. ',
-      });
+      return res.status(409).json({});
     }
 
killedBy: Auth controller register: повертає помилку, якщо username вже зайнятий
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Даний username вже зайнятий. ",
- }

[Killed] ObjectLiteral
controllers/auth.js:21:30
     const salt = bcrypt.genSaltSync(10);
     const hash = bcrypt.hashSync(password, salt);
 
-    const newUser = new User({
-      username,
-      password: hash,
-    });
+    const newUser = new User({});
 
     await newUser.save();
killedBy: Auth controller register: успішна реєстрація
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Реєстрація пройшла успішно.",
-   "newUser": ObjectContaining {

[Survived] ObjectLiteral
controllers/auth.js:29:7
     await newUser.save();
 
     const token = jwt.sign(
-      {
-        id: newUser._id,
-      },
+      {},
       process.env.JWT_SECRET,
       { expiresIn: '30d' }

[Survived] ObjectLiteral
controllers/auth.js:33:7
         id: newUser._id,
       },
       process.env.JWT_SECRET,
-      { expiresIn: '30d' }
+      {}
     );
 

[Killed] StringLiteral
controllers/auth.js:39:16
     res.status(200).json({
       newUser,
       token,
-      message: 'Реєстрація пройшла успішно.',
+      message: "",
     });
   } catch (error) {
killedBy: Auth controller register: успішна реєстрація
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Реєстрація пройшла успішно.",
-   "newUser": ObjectContaining {

[NoCoverage] BlockStatement
controllers/auth.js:41:19
       token,
       message: 'Реєстрація пройшла успішно.',
     });
-  } catch (error) {
-    res.status(500).json({ message: 'Помилка при створені користувача' });
-  }
+  } catch (error) {}
 };
 

[Killed] ObjectLiteral
controllers/auth.js:50:37
 export const login = async (req, res) => {
   try {
     const { username, password } = req.body;
-    const user = await User.findOne({ username });
+    const user = await User.findOne({});
 
     if (!user) {
killedBy: Full integration test: Auth → Post → Comment Login user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BlockStatement
controllers/auth.js:52:16
     const { username, password } = req.body;
     const user = await User.findOne({ username });
 
-    if (!user) {
-      return res.status(404).json({
-        message: 'Такого корситувача не існує.',
-      });
-    }
+    if (!user) {}
 
     const isPasswordCorrect = await bcrypt.compare(password, user.password);
killedBy: Auth controller login: помилка — юзера не існує
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Такого корситувача не існує.",
+   "message": "Помилка при авторизації",

[Killed] ObjectLiteral
controllers/auth.js:53:35
     const user = await User.findOne({ username });
 
     if (!user) {
-      return res.status(404).json({
-        message: 'Такого корситувача не існує.',
-      });
+      return res.status(404).json({});
     }
 
killedBy: Auth controller login: помилка — юзера не існує
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Такого корситувача не існує.",
- }

[Killed] ConditionalExpression
controllers/auth.js:60:9
 
     const isPasswordCorrect = await bcrypt.compare(password, user.password);
 
-    if (!isPasswordCorrect) {
+    if (true) {
       return res.status(400).json({
         message: 'Неправильний пароль.',
killedBy: Full integration test: Auth → Post → Comment Login user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BooleanLiteral
controllers/auth.js:60:9
 
     const isPasswordCorrect = await bcrypt.compare(password, user.password);
 
-    if (!isPasswordCorrect) {
+    if (isPasswordCorrect) {
       return res.status(400).json({
         message: 'Неправильний пароль.',
killedBy: Auth controller login: неправильний пароль
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Неправильний пароль.",
+   "message": "Ви увійшли в систему.",

[Killed] StringLiteral
controllers/auth.js:77:16
     res.json({
       token,
       user,
-      message: 'Ви увійшли в систему.',
+      message: "",
     });
   } catch (error) {
killedBy: Full integration test: Auth → Post → Comment Login user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[NoCoverage] BlockStatement
controllers/auth.js:79:19
       user,
       message: 'Ви увійшли в систему.',
     });
-  } catch (error) {
-    res.status(500).json({ message: 'Помилка при авторизації' });
-  }
+  } catch (error) {}
 };
 // Get me

[NoCoverage] ObjectLiteral
controllers/auth.js:80:26
       message: 'Ви увійшли в систему.',
     });
   } catch (error) {
-    res.status(500).json({ message: 'Помилка при авторизації' });
+    res.status(500).json({});
   }
 };

[Killed] BlockStatement
controllers/auth.js:85:7
 };
 // Get me
 export const getMe = async (req, res) => {
-  try {
-    const user = await User.findById(req.userId);
-
-    if (!user) {
-      return res.json({
-        message: 'Такого корситувача не існує.',
-      });
-    }
-
-    const token = jwt.sign(
-      {
-        id: user._id,
-      },
-      process.env.JWT_SECRET,
-      { expiresIn: '30d' }
-    );
-
-    res.json({
-      token,
-      user,
-    });
-  } catch (error) {
+  try {} catch (error) {
     res.json({ message: 'Немає доступу.' });
   }
killedBy: Auth controller getMe: юзера не існує
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"message": "Такого корситувача не існує."}

Number of calls: 0

[Killed] ObjectLiteral
controllers/auth.js:89:23
     const user = await User.findById(req.userId);
 
     if (!user) {
-      return res.json({
-        message: 'Такого корситувача не існує.',
-      });
+      return res.json({});
     }
 
killedBy: Auth controller getMe: юзера не існує
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Такого корситувача не існує.",
- }

[Survived] StringLiteral
controllers/auth.js:99:20
         id: user._id,
       },
       process.env.JWT_SECRET,
-      { expiresIn: '30d' }
+      { expiresIn: "" }
     );
 

[NoCoverage] BlockStatement
controllers/auth.js:106:19
       token,
       user,
     });
-  } catch (error) {
-    res.json({ message: 'Немає доступу.' });
-  }
+  } catch (error) {}
 };
 

[NoCoverage] ObjectLiteral
controllers/auth.js:107:14
       user,
     });
   } catch (error) {
-    res.json({ message: 'Немає доступу.' });
+    res.json({});
   }
 };
