[Killed] BlockStatement
controllers/comments.js:4:50
 import Comment from '../models/Comment.js';
 import Post from '../models/Post.js';
 
-export const createComment = async (req, res) => {
-  try {
-    //const { postId, comment } = req.body;
-    const { comment } = req.body;
-    const postId = req.params.id;
-
-    if (!comment) return res.json({ messege: 'Коментар не може бути пустим' });
-
-    const newComment = new Comment({ comment });
-    await newComment.save();
-
-    try {
-      await Post.findByIdAndUpdate(postId, {
-        $push: { comments: newComment._id },
-      });
-    } catch (error) {
-      console.log(error);
-    }
-
-    res.status(201).json(newComment);
-  } catch (error) {
-    res.json({ messege: 'Щось пішло не так.' });
-  }
-};
+export const createComment = async (req, res) => {};
 
killedBy: Full integration test: Auth → Post → Comment Create comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 200

[Killed] BlockStatement
controllers/comments.js:5:7
 import Post from '../models/Post.js';
 
 export const createComment = async (req, res) => {
-  try {
-    //const { postId, comment } = req.body;
-    const { comment } = req.body;
-    const postId = req.params.id;
-
-    if (!comment) return res.json({ messege: 'Коментар не може бути пустим' });
-
-    const newComment = new Comment({ comment });
-    await newComment.save();
-
-    try {
-      await Post.findByIdAndUpdate(postId, {
-        $push: { comments: newComment._id },
-      });
-    } catch (error) {
-      console.log(error);
-    }
-
-    res.status(201).json(newComment);
-  } catch (error) {
+  try {} catch (error) {
     res.json({ messege: 'Щось пішло не так.' });
   }
killedBy: Full integration test: Auth → Post → Comment Create comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 200

[Killed] BooleanLiteral
controllers/comments.js:10:9
     const { comment } = req.body;
     const postId = req.params.id;
 
-    if (!comment) return res.json({ messege: 'Коментар не може бути пустим' });
+    if (comment) return res.json({ messege: 'Коментар не може бути пустим' });
 
     const newComment = new Comment({ comment });
killedBy: Full integration test: Auth → Post → Comment Create comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 200

[Killed] ConditionalExpression
controllers/comments.js:10:9
     const { comment } = req.body;
     const postId = req.params.id;
 
-    if (!comment) return res.json({ messege: 'Коментар не може бути пустим' });
+    if (true) return res.json({ messege: 'Коментар не може бути пустим' });
 
     const newComment = new Comment({ comment });
killedBy: Full integration test: Auth → Post → Comment Create comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 200

[Killed] BlockStatement
controllers/comments.js:15:9
     const newComment = new Comment({ comment });
     await newComment.save();
 
-    try {
-      await Post.findByIdAndUpdate(postId, {
-        $push: { comments: newComment._id },
-      });
-    } catch (error) {
+    try {} catch (error) {
       console.log(error);
     }
killedBy: Full integration test: Auth → Post → Comment Create comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 200

[NoCoverage] BlockStatement
controllers/comments.js:19:21
       await Post.findByIdAndUpdate(postId, {
         $push: { comments: newComment._id },
       });
-    } catch (error) {
-      console.log(error);
-    }
+    } catch (error) {}
 
     res.status(201).json(newComment);

[NoCoverage] BlockStatement
controllers/comments.js:24:19
     }
 
     res.status(201).json(newComment);
-  } catch (error) {
-    res.json({ messege: 'Щось пішло не так.' });
-  }
+  } catch (error) {}
 };
 
