[Killed] ConditionalExpression
controllers/posts.js:14:9
     const { title, text } = req.body;
     const user = await User.findById(req.userId);
 
-    if (req.files) {
+    if (true) {
       let fileName = Date.now().toString() + req.files.image.name;
       const __dirname = dirname(fileURLToPath(import.meta.url));
killedBy: Full integration test: Auth → Post → Comment Create post
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "_id"
Received path: []

Received value: {"message": "Немає доступу."}

[Killed] ConditionalExpression
controllers/posts.js:14:9
     const { title, text } = req.body;
     const user = await User.findById(req.userId);
 
-    if (req.files) {
+    if (false) {
       let fileName = Date.now().toString() + req.files.image.name;
       const __dirname = dirname(fileURLToPath(import.meta.url));
killedBy: Full integration test: Auth → Post → Comment Create post
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "_id"
Received path: []

Received value: {"message": "Немає доступу."}

[NoCoverage] ArithmeticOperator
controllers/posts.js:15:22
     const user = await User.findById(req.userId);
 
     if (req.files) {
-      let fileName = Date.now().toString() + req.files.image.name;
+      let fileName = Date.now().toString() - req.files.image.name;
       const __dirname = dirname(fileURLToPath(import.meta.url));
       req.files.image.mv(path.join(__dirname, '..', 'uploads', fileName));

[NoCoverage] ObjectLiteral
controllers/posts.js:19:41
       const __dirname = dirname(fileURLToPath(import.meta.url));
       req.files.image.mv(path.join(__dirname, '..', 'uploads', fileName));
 
-      const newPostWithImage = new Post({
-        username: user.username,
-        title,
-        text,
-        imgUrl: fileName,
-        author: req.userId,
-      });
+      const newPostWithImage = new Post({});
 
       await newPostWithImage.save();

[NoCoverage] ObjectLiteral
controllers/posts.js:28:48
       });
 
       await newPostWithImage.save();
-      await User.findByIdAndUpdate(req.userId, {
-        $push: { posts: newPostWithImage },
-      });
+      await User.findByIdAndUpdate(req.userId, {});
 
       return res.json(newPostWithImage);

[Killed] StringLiteral
controllers/posts.js:39:15
       username: user.username,
       title,
       text,
-      imgUrl: '',
+      imgUrl: "Stryker was here!",
       author: req.userId,
     });
killedBy: Full integration test: Auth → Post → Comment Create post
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "_id"
Received path: []

Received value: {"message": "Немає доступу."}

[Killed] ObjectLiteral
controllers/posts.js:44:14
     });
     await newPostWithoutImage.save();
     await User.findByIdAndUpdate(req.userId, {
-      $push: { posts: newPostWithoutImage },
+      $push: {},
     });
     res.json(newPostWithoutImage);
killedBy: Full integration test: Auth → Post → Comment Create post
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "_id"
Received path: []

Received value: {"message": "Немає доступу."}

[NoCoverage] BlockStatement
controllers/posts.js:47:19
       $push: { posts: newPostWithoutImage },
     });
     res.json(newPostWithoutImage);
-  } catch (error) {
-    res.json({ message: 'Щось пішло не так.' });
-  }
+  } catch (error) {}
 };
 

[NoCoverage] ObjectLiteral
controllers/posts.js:48:14
     });
     res.json(newPostWithoutImage);
   } catch (error) {
-    res.json({ message: 'Щось пішло не так.' });
+    res.json({});
   }
 };

[NoCoverage] BlockStatement
controllers/posts.js:53:43
 };
 
 // Get All Posts
-export const getAll = async (req, res) => {
-  try {
-    const posts = await Post.find().sort('-createdAt');
-    const popularPosts = await Post.find().limit(5).sort('-views');
-
-    if (!posts) {
-      return res.json({ message: 'Постів немає.' });
-    }
-
-    res.json({ posts, popularPosts });
-  } catch (error) {
-    res.json({ message: 'Щось пішло не так.' });
-  }
-};
+export const getAll = async (req, res) => {};
 
 // Get Post By Id

[NoCoverage] BlockStatement
controllers/posts.js:54:7
 
 // Get All Posts
 export const getAll = async (req, res) => {
-  try {
-    const posts = await Post.find().sort('-createdAt');
-    const popularPosts = await Post.find().limit(5).sort('-views');
-
-    if (!posts) {
-      return res.json({ message: 'Постів немає.' });
-    }
-
-    res.json({ posts, popularPosts });
-  } catch (error) {
+  try {} catch (error) {
     res.json({ message: 'Щось пішло не так.' });
   }

[NoCoverage] MethodExpression
controllers/posts.js:55:25
 // Get All Posts
 export const getAll = async (req, res) => {
   try {
-    const posts = await Post.find().sort('-createdAt');
+    const posts = await Post.find();
     const popularPosts = await Post.find().limit(5).sort('-views');
 

[NoCoverage] MethodExpression
controllers/posts.js:56:32
 export const getAll = async (req, res) => {
   try {
     const posts = await Post.find().sort('-createdAt');
-    const popularPosts = await Post.find().limit(5).sort('-views');
+    const popularPosts = await Post.find().limit(5);
 
     if (!posts) {

[NoCoverage] BooleanLiteral
controllers/posts.js:58:9
     const posts = await Post.find().sort('-createdAt');
     const popularPosts = await Post.find().limit(5).sort('-views');
 
-    if (!posts) {
+    if (posts) {
       return res.json({ message: 'Постів немає.' });
     }

[NoCoverage] BlockStatement
controllers/posts.js:58:17
     const posts = await Post.find().sort('-createdAt');
     const popularPosts = await Post.find().limit(5).sort('-views');
 
-    if (!posts) {
-      return res.json({ message: 'Постів немає.' });
-    }
+    if (!posts) {}
 
     res.json({ posts, popularPosts });

[NoCoverage] BlockStatement
controllers/posts.js:63:19
     }
 
     res.json({ posts, popularPosts });
-  } catch (error) {
-    res.json({ message: 'Щось пішло не так.' });
-  }
+  } catch (error) {}
 };
 

[Timeout] BlockStatement
controllers/posts.js:69:44
 };
 
 // Get Post By Id
-export const getById = async (req, res) => {
-  try {
-    const post = await Post.findByIdAndUpdate(req.params.id, {
-      $inc: { views: 1 } },
-      { new: true } 
-    );
-    res.json(post);
-  } catch (error) {
-    res.json({ message: 'Щось пішло не так.' });
-  }
-};
+export const getById = async (req, res) => {};
 
 // Get My Posts

[Timeout] BlockStatement
controllers/posts.js:70:7
 
 // Get Post By Id
 export const getById = async (req, res) => {
-  try {
-    const post = await Post.findByIdAndUpdate(req.params.id, {
-      $inc: { views: 1 } },
-      { new: true } 
-    );
-    res.json(post);
-  } catch (error) {
+  try {} catch (error) {
     res.json({ message: 'Щось пішло не так.' });
   }

[Killed] ObjectLiteral
controllers/posts.js:72:13
 export const getById = async (req, res) => {
   try {
     const post = await Post.findByIdAndUpdate(req.params.id, {
-      $inc: { views: 1 } },
+      $inc: {} },
       { new: true } 
     );
killedBy: Full integration test: Auth → Post → Comment Get post by ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "My first post"
Received: undefined

[Killed] BooleanLiteral
controllers/posts.js:73:14
   try {
     const post = await Post.findByIdAndUpdate(req.params.id, {
       $inc: { views: 1 } },
-      { new: true } 
+      { new: false } 
     );
     res.json(post);
killedBy: Full integration test: Auth → Post → Comment Get post by ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "My first post"
Received: undefined

[Killed] ObjectLiteral
controllers/posts.js:73:7
   try {
     const post = await Post.findByIdAndUpdate(req.params.id, {
       $inc: { views: 1 } },
-      { new: true } 
+      {} 
     );
     res.json(post);
killedBy: Full integration test: Auth → Post → Comment Get post by ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "My first post"
Received: undefined

[NoCoverage] BlockStatement
controllers/posts.js:76:19
       { new: true } 
     );
     res.json(post);
-  } catch (error) {
-    res.json({ message: 'Щось пішло не так.' });
-  }
+  } catch (error) {}
 };
 

[NoCoverage] StringLiteral
controllers/posts.js:77:25
     );
     res.json(post);
   } catch (error) {
-    res.json({ message: 'Щось пішло не так.' });
+    res.json({ message: "" });
   }
 };

[NoCoverage] BlockStatement
controllers/posts.js:82:47
 };
 
 // Get My Posts
-export const getMyPosts = async (req, res) => {
-  try {
-    const user = await User.findById(req.userId);
-    const list = await Promise.all(
-      user.posts.map((post) => {
-        return Post.findById(post._id);
-      })
-    );
-
-    res.json(list);
-  } catch (error) {
-    res.json({ message: 'Щось пішло не так.' });
-  }
-};
+export const getMyPosts = async (req, res) => {};
 
 // Remove Post

[NoCoverage] BlockStatement
controllers/posts.js:83:7
 
 // Get My Posts
 export const getMyPosts = async (req, res) => {
-  try {
-    const user = await User.findById(req.userId);
-    const list = await Promise.all(
-      user.posts.map((post) => {
-        return Post.findById(post._id);
-      })
-    );
-
-    res.json(list);
-  } catch (error) {
+  try {} catch (error) {
     res.json({ message: 'Щось пішло не так.' });
   }

[NoCoverage] BlockStatement
controllers/posts.js:86:32
   try {
     const user = await User.findById(req.userId);
     const list = await Promise.all(
-      user.posts.map((post) => {
-        return Post.findById(post._id);
-      })
+      user.posts.map((post) => {})
     );
 

[NoCoverage] BlockStatement
controllers/posts.js:92:19
     );
 
     res.json(list);
-  } catch (error) {
-    res.json({ message: 'Щось пішло не так.' });
-  }
+  } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/posts.js:98:47
 };
 
 // Remove Post
-export const removePost = async (req, res) => {
-  try {
-    const post = await Post.findByIdAndDelete(req.params.id);
-    if (!post) return res.json({ message: 'Такого поста не існує.' });
-
-    await User.findByIdAndUpdate(req.userId, {
-      $pull: { posts: req.params.id },
-    });
-
-    res.json({ message: 'Пост видалено.' });
-  } catch (error) {
-    res.json({ message: 'Щось пішло не так.' });
-  }
-};
+export const removePost = async (req, res) => {};
 
 // Update Post

[NoCoverage] BlockStatement
controllers/posts.js:99:7
 
 // Remove Post
 export const removePost = async (req, res) => {
-  try {
-    const post = await Post.findByIdAndDelete(req.params.id);
-    if (!post) return res.json({ message: 'Такого поста не існує.' });
-
-    await User.findByIdAndUpdate(req.userId, {
-      $pull: { posts: req.params.id },
-    });
-
-    res.json({ message: 'Пост видалено.' });
-  } catch (error) {
+  try {} catch (error) {
     res.json({ message: 'Щось пішло не так.' });
   }

[NoCoverage] ConditionalExpression
controllers/posts.js:101:9
 export const removePost = async (req, res) => {
   try {
     const post = await Post.findByIdAndDelete(req.params.id);
-    if (!post) return res.json({ message: 'Такого поста не існує.' });
+    if (false) return res.json({ message: 'Такого поста не існує.' });
 
     await User.findByIdAndUpdate(req.userId, {

[NoCoverage] ConditionalExpression
controllers/posts.js:101:9
 export const removePost = async (req, res) => {
   try {
     const post = await Post.findByIdAndDelete(req.params.id);
-    if (!post) return res.json({ message: 'Такого поста не існує.' });
+    if (true) return res.json({ message: 'Такого поста не існує.' });
 
     await User.findByIdAndUpdate(req.userId, {

[NoCoverage] ObjectLiteral
controllers/posts.js:104:14
     if (!post) return res.json({ message: 'Такого поста не існує.' });
 
     await User.findByIdAndUpdate(req.userId, {
-      $pull: { posts: req.params.id },
+      $pull: {},
     });
 

[NoCoverage] ObjectLiteral
controllers/posts.js:107:14
       $pull: { posts: req.params.id },
     });
 
-    res.json({ message: 'Пост видалено.' });
+    res.json({});
   } catch (error) {
     res.json({ message: 'Щось пішло не так.' });

[NoCoverage] BlockStatement
controllers/posts.js:108:19
     });
 
     res.json({ message: 'Пост видалено.' });
-  } catch (error) {
-    res.json({ message: 'Щось пішло не так.' });
-  }
+  } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/posts.js:114:47
 };
 
 // Update Post
-export const updatePost = async (req, res) => {
-  try {
-    const { title, text, id } = req.body;
-    const post = await Post.findById(id);
-
-    if (req.files) {
-      let fileName = Date.now().toString() + req.files.image.name;
-      const __dirname = dirname(fileURLToPath(import.meta.url));
-      req.files.image.mv(path.join(__dirname, '..', 'uploads', fileName));
-      post.imgUrl = fileName || ' ';
-    }
-
-    post.title = title;
-    post.text = text;
-
-    await post.save();
-
-    res.json(post);
-  } catch (error) {
-    res.json({ message: 'Щось пішло не так.' });
-  }
-};
+export const updatePost = async (req, res) => {};
 
 // Get Post Comments

[NoCoverage] BlockStatement
controllers/posts.js:115:7
 
 // Update Post
 export const updatePost = async (req, res) => {
-  try {
-    const { title, text, id } = req.body;
-    const post = await Post.findById(id);
-
-    if (req.files) {
-      let fileName = Date.now().toString() + req.files.image.name;
-      const __dirname = dirname(fileURLToPath(import.meta.url));
-      req.files.image.mv(path.join(__dirname, '..', 'uploads', fileName));
-      post.imgUrl = fileName || ' ';
-    }
-
-    post.title = title;
-    post.text = text;
-
-    await post.save();
-
-    res.json(post);
-  } catch (error) {
+  try {} catch (error) {
     res.json({ message: 'Щось пішло не так.' });
   }

[NoCoverage] BlockStatement
controllers/posts.js:119:20
     const { title, text, id } = req.body;
     const post = await Post.findById(id);
 
-    if (req.files) {
-      let fileName = Date.now().toString() + req.files.image.name;
-      const __dirname = dirname(fileURLToPath(import.meta.url));
-      req.files.image.mv(path.join(__dirname, '..', 'uploads', fileName));
-      post.imgUrl = fileName || ' ';
-    }
+    if (req.files) {}
 
     post.title = title;

[NoCoverage] StringLiteral
controllers/posts.js:122:47
     if (req.files) {
       let fileName = Date.now().toString() + req.files.image.name;
       const __dirname = dirname(fileURLToPath(import.meta.url));
-      req.files.image.mv(path.join(__dirname, '..', 'uploads', fileName));
+      req.files.image.mv(path.join(__dirname, "", 'uploads', fileName));
       post.imgUrl = fileName || ' ';
     }

[NoCoverage] LogicalOperator
controllers/posts.js:123:21
       let fileName = Date.now().toString() + req.files.image.name;
       const __dirname = dirname(fileURLToPath(import.meta.url));
       req.files.image.mv(path.join(__dirname, '..', 'uploads', fileName));
-      post.imgUrl = fileName || ' ';
+      post.imgUrl = fileName && ' ';
     }
 

[NoCoverage] ConditionalExpression
controllers/posts.js:123:21
       let fileName = Date.now().toString() + req.files.image.name;
       const __dirname = dirname(fileURLToPath(import.meta.url));
       req.files.image.mv(path.join(__dirname, '..', 'uploads', fileName));
-      post.imgUrl = fileName || ' ';
+      post.imgUrl = false;
     }
 

[Timeout] BlockStatement
controllers/posts.js:138:52
 };
 
 // Get Post Comments
-export const getPostComments = async (req, res) => {
-  try {
-    const post = await Post.findById(req.params.id);
-    
-    if (!post) {
-      return res.status(404).json({ message: 'Пост не знайдено' });
-    }
-    const list = await Promise.all(
-      post.comments.map((comment) => {
-        return Comment.findById(comment);
-      })
-    );
-    res.json(list);
-  } catch (error) {
-    res.json({ message: 'Щось пішло не так.' });
-  }
-};
+export const getPostComments = async (req, res) => {};
 

[Timeout] BlockStatement
controllers/posts.js:139:7
 
 // Get Post Comments
 export const getPostComments = async (req, res) => {
-  try {
-    const post = await Post.findById(req.params.id);
-    
-    if (!post) {
-      return res.status(404).json({ message: 'Пост не знайдено' });
-    }
-    const list = await Promise.all(
-      post.comments.map((comment) => {
-        return Comment.findById(comment);
-      })
-    );
-    res.json(list);
-  } catch (error) {
+  try {} catch (error) {
     res.json({ message: 'Щось пішло не так.' });
   }

[Killed] BooleanLiteral
controllers/posts.js:142:9
   try {
     const post = await Post.findById(req.params.id);
     
-    if (!post) {
+    if (post) {
       return res.status(404).json({ message: 'Пост не знайдено' });
     }
killedBy: Full integration test: Auth → Post → Comment Get comments of post
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ConditionalExpression
controllers/posts.js:142:9
   try {
     const post = await Post.findById(req.params.id);
     
-    if (!post) {
+    if (false) {
       return res.status(404).json({ message: 'Пост не знайдено' });
     }
killedBy: Full integration test: Auth → Post → Comment Get comments of post
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
controllers/posts.js:146:38
       return res.status(404).json({ message: 'Пост не знайдено' });
     }
     const list = await Promise.all(
-      post.comments.map((comment) => {
-        return Comment.findById(comment);
-      })
+      post.comments.map((comment) => {})
     );
     res.json(list);
killedBy: Full integration test: Auth → Post → Comment Get comments of post
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined
