[Timeout] BlockStatement
utils/checkAuth.js:3:46
 import jwt from 'jsonwebtoken'
 
-export const checkAuth = (req, res, next) => {
-    const token = (req.headers.authorization || '').replace(/Bearer\s?/, '')
-
-    if(token){
-        try {
-            const decoded = jwt.verify(token,  process.env.JWT_SECRET)
-
-            req.userId = decoded.id
-            
-            next()
-        } catch (error) {
-            return res.json({
-                message: 'Немає доступу.'
-            })
-        }
-    } else {
-        return res.json({
-            message: 'Немає доступу.'
-        })
-    }
-}
+export const checkAuth = (req, res, next) => {}

[Killed] LogicalOperator
utils/checkAuth.js:4:20
 import jwt from 'jsonwebtoken'
 
 export const checkAuth = (req, res, next) => {
-    const token = (req.headers.authorization || '').replace(/Bearer\s?/, '')
+    const token = (req.headers.authorization && '').replace(/Bearer\s?/, '')
 
     if(token){
killedBy: Full integration test: Auth → Post → Comment Create post
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "_id"
Received path: []

Received value: {"message": "Немає доступу."}

[Killed] ConditionalExpression
utils/checkAuth.js:4:20
 import jwt from 'jsonwebtoken'
 
 export const checkAuth = (req, res, next) => {
-    const token = (req.headers.authorization || '').replace(/Bearer\s?/, '')
+    const token = (true).replace(/Bearer\s?/, '')
 
     if(token){
killedBy: Full integration test: Auth → Post → Comment Create post
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Timeout] BlockStatement
utils/checkAuth.js:7:13
     const token = (req.headers.authorization || '').replace(/Bearer\s?/, '')
 
     if(token){
-        try {
-            const decoded = jwt.verify(token,  process.env.JWT_SECRET)
-
-            req.userId = decoded.id
-            
-            next()
-        } catch (error) {
+        try {} catch (error) {
             return res.json({
                 message: 'Немає доступу.'

[NoCoverage] BlockStatement
utils/checkAuth.js:13:25
             req.userId = decoded.id
             
             next()
-        } catch (error) {
-            return res.json({
-                message: 'Немає доступу.'
-            })
-        }
+        } catch (error) {}
     } else {
         return res.json({

[NoCoverage] BlockStatement
utils/checkAuth.js:18:12
                 message: 'Немає доступу.'
             })
         }
-    } else {
-        return res.json({
-            message: 'Немає доступу.'
-        })
-    }
+    } else {}
 }
