[Survived] ObjectLiteral
models/Comment.js:6:17
 const CommentSchema = new mongoose.Schema(
     {
         comment: { type: String },
-        author: { type: mongoose.Schema.Types.ObjectId, ref: 'User' },
+        author: {},
     },
     { timestamps: true },
