[Survived] BooleanLiteral
models/Post.js:6:42
 const PostSchema = new mongoose.Schema(
     {
         username: { type: String },
-        title: { type: String, required: true },
+        title: { type: String, required: false },
         text: { type: String, required: true },
         imgUrl: { type: String, default: '' },

[Survived] ObjectLiteral
models/Post.js:6:16
 const PostSchema = new mongoose.Schema(
     {
         username: { type: String },
-        title: { type: String, required: true },
+        title: {},
         text: { type: String, required: true },
         imgUrl: { type: String, default: '' },

[Survived] BooleanLiteral
models/Post.js:7:41
     {
         username: { type: String },
         title: { type: String, required: true },
-        text: { type: String, required: true },
+        text: { type: String, required: false },
         imgUrl: { type: String, default: '' },
         views: { type: Number, default: 0 },

[Timeout] ObjectLiteral
models/Post.js:8:17
         username: { type: String },
         title: { type: String, required: true },
         text: { type: String, required: true },
-        imgUrl: { type: String, default: '' },
+        imgUrl: {},
         views: { type: Number, default: 0 },
         author: { type: mongoose.Schema.Types.ObjectId, ref: 'User' },

[Timeout] StringLiteral
models/Post.js:8:42
         username: { type: String },
         title: { type: String, required: true },
         text: { type: String, required: true },
-        imgUrl: { type: String, default: '' },
+        imgUrl: { type: String, default: "Stryker was here!" },
         views: { type: Number, default: 0 },
         author: { type: mongoose.Schema.Types.ObjectId, ref: 'User' },

[Survived] StringLiteral
models/Post.js:10:62
         text: { type: String, required: true },
         imgUrl: { type: String, default: '' },
         views: { type: Number, default: 0 },
-        author: { type: mongoose.Schema.Types.ObjectId, ref: 'User' },
+        author: { type: mongoose.Schema.Types.ObjectId, ref: "" },
         comments: [{ type: mongoose.Schema.Types.ObjectId, ref: 'Comment' }],
     },
