[Timeout] ObjectLiteral
models/User.js:5:19
 
 const UserSchema = new mongoose.Schema(
     {
-        username: {
-            type: String,
-            required: true,
-            unigue: true,
-        },
+        username: {},
         password: {
             type: String,

[Survived] BooleanLiteral
models/User.js:8:21
         username: {
             type: String,
             required: true,
-            unigue: true,
+            unigue: false,
         },
         password: {

[Survived] BooleanLiteral
models/User.js:22:18
     ],
     }
     ,
-    {timestamps: true},
+    {timestamps: false},
 )
 
