[Survived] StringLiteral
routes/posts.js:17:13
 
 // Create post
 //http://localhost:3002/api/posts
-router.post('/', checkAuth, createPost);
+router.post("", checkAuth, createPost);
 
 // Get All Posts

[Survived] StringLiteral
routes/posts.js:21:12
 
 // Get All Posts
 //http://localhost:3002/api/posts
-router.get('/', getAll);
+router.get("", getAll);
 
 // Get My Posts

[Survived] StringLiteral
routes/posts.js:37:12
 
 // Update Post 
 //http://localhost:3002/api/posts/:id
-router.put('/:id', checkAuth, updatePost);
+router.put("", checkAuth, updatePost);
 
 // Get Post Comments
